apache/nuttx/arch/arm/src/tiva/cc13xx/cc13x2_cc26x2_v2_rom.h
#define ROM_OSCClockSourceSet \
    ((void (*)(uint32_t ui32SrcClk, uint32_t ui32Osc)) \
    ROM_API_OSC_TABLE[1])

#define ROM_OSC_HPOSCRelativeFrequencyOffsetGet \
    ((int32_t (*)(int32_t tempDegC)) \
    ROM_API_OSC_TABLE[2])

#define ROM_OSC_HPOSCRelativeFrequencyOffsetToRFCoreFormatConvert \
    ((int16_t (*)(int32_t HPOSC_RelFreqOffset)) \
    ROM_API_OSC_TABLE[3])

/* AUX_ADC FUNCTIONS */

#define ROM_AUXADCAdjustValueForGainAndOffset \
    ((int32_t (*)(int32_t adcValue, int32_t gain, int32_t offset)) \
    ROM_API_AUX_ADC_TABLE[0])

#define ROM_AUXADCDisable \
    ((void (*)(void)) \
    ROM_API_AUX_ADC_TABLE[1])

#define ROM_AUXADCDisableInputScaling \
    ((void (*)(void)) \
    ROM_API_AUX_ADC_TABLE[2])

#define ROM_AUXADCEnableAsync \
    ((void (*)(uint32_t refSource, uint32_t trigger)) \
    ROM_API_AUX_ADC_TABLE[3])

#define ROM_AUXADCEnableSync \
    ((void (*)(uint32_t refSource, uint32_t sampleTime, uint32_t trigger)) \
    ROM_API_AUX_ADC_TABLE[4])

#define ROM_AUXADCFlushFifo \
    ((void (*)(void)) \
    ROM_API_AUX_ADC_TABLE[5])

#define ROM_AUXADCGetAdjustmentGain \
    ((int32_t (*)(uint32_t refSource)) \
    ROM_API_AUX_ADC_TABLE[6])

#define ROM_AUXADCGetAdjustmentOffset \
    ((int32_t (*)(uint32_t refSource)) \
    ROM_API_AUX_ADC_TABLE[7])

#define ROM_AUXADCMicrovoltsToValue \
    ((int32_t (*)(int32_t fixedRefVoltage, int32_t microvolts)) \
    ROM_API_AUX_ADC_TABLE[8])

#define ROM_AUXADCPopFifo \
    ((uint32_t (*)(void)) \
    ROM_API_AUX_ADC_TABLE[9])

#define ROM_AUXADCReadFifo \
    ((uint32_t (*)(void)) \
    ROM_API_AUX_ADC_TABLE[10])

#define ROM_AUXADCUnadjustValueForGainAndOffset \
    ((int32_t (*)(int32_t adcValue, int32_t gain, int32_t offset)) \
    ROM_API_AUX_ADC_TABLE[11])

#define ROM_AUXADCValueToMicrovolts \
    ((int32_t (*)(int32_t fixedRefVoltage, int32_t adcValue)) \
    ROM_API_AUX_ADC_TABLE[12])

/* SYS_CTRL FUNCTIONS */

#define ROM_SysCtrlResetSourceGet \
    ((uint32_t (*)(void)) \
    ROM_API_SYS_CTRL_TABLE[0])

#define ROM_SysCtrl_DCDC_VoltageConditionalControl \
    ((void (*)(void)) \
    ROM_API_SYS_CTRL_TABLE[1])

/* AON_BATMON FUNCTIONS */

#define ROM_AONBatMonTemperatureGetDegC \
    ((int32_t (*)(void)) \
    ROM_API_AON_BATMON_TABLE[0])

/* SETUP_ROM FUNCTIONS */

#define ROM_SetupAfterColdResetWakeupFromShutDownCfg1 \
    ((void (*)(uint32_t ccfg_ModeConfReg)) \
    ROM_API_SETUP_ROM_TABLE[0])

#define ROM_SetupAfterColdResetWakeupFromShutDownCfg2 \
    ((void (*)(uint32_t ui32Fcfg1Revision, uint32_t ccfg_ModeConfReg)) \
    ROM_API_SETUP_ROM_TABLE[1])

#define ROM_SetupAfterColdResetWakeupFromShutDownCfg3 \
    ((void (*)(uint32_t ccfg_ModeConfReg)) \
    ROM_API_SETUP_ROM_TABLE[2])

#define ROM_SetupGetTrimForAdcShModeEn \
    ((uint32_t (*)(uint32_t ui32Fcfg1Revision)) \
    ROM_API_SETUP_ROM_TABLE[3])

#define ROM_SetupGetTrimForAdcShVbufEn \
    ((uint32_t (*)(uint32_t ui32Fcfg1Revision)) \
    ROM_API_SETUP_ROM_TABLE[4])

#define ROM_SetupGetTrimForAmpcompCtrl \
    ((uint32_t (*)(uint32_t ui32Fcfg1Revision)) \
    ROM_API_SETUP_ROM_TABLE[5])

#define ROM_SetupGetTrimForAmpcompTh1 \
    ((uint32_t (*)(void)) \
    ROM_API_SETUP_ROM_TABLE[6])

#define ROM_SetupGetTrimForAmpcompTh2 \
    ((uint32_t (*)(void)) \
    ROM_API_SETUP_ROM_TABLE[7])

#define ROM_SetupGetTrimForAnabypassValue1 \
    ((uint32_t (*)(uint32_t ccfg_ModeConfReg)) \
    ROM_API_SETUP_ROM_TABLE[8])

#define ROM_SetupGetTrimForDblrLoopFilterResetVoltage \
    ((uint32_t (*)(uint32_t ui32Fcfg1Revision)) \
    ROM_API_SETUP_ROM_TABLE[9])

#define ROM_SetupGetTrimForRadcExtCfg \
    ((uint32_t (*)(uint32_t ui32Fcfg1Revision)) \
    ROM_API_SETUP_ROM_TABLE[10])

#define ROM_SetupGetTrimForRcOscLfIBiasTrim \
    ((uint32_t (*)(uint32_t ui32Fcfg1Revision)) \
    ROM_API_SETUP_ROM_TABLE[11])

#define ROM_SetupGetTrimForRcOscLfRtuneCtuneTrim \
    ((uint32_t (*)(void)) \
    ROM_API_SETUP_ROM_TABLE[12])

#define ROM_SetupGetTrimForXoscHfCtl \
    ((uint32_t (*)(uint32_t ui32Fcfg1Revision)) \
    ROM_API_SETUP_ROM_TABLE[13])

#define ROM_SetupGetTrimForXoscHfFastStart \
    ((uint32_t (*)(void)) \
    ROM_API_SETUP_ROM_TABLE[14])

#define ROM_SetupGetTrimForXoscHfIbiastherm \
    ((uint32_t (*)(void)) \
    ROM_API_SETUP_ROM_TABLE[15])

#define ROM_SetupGetTrimForXoscLfRegulatorAndCmirrwrRatio \
    ((uint32_t (*)(uint32_t ui32Fcfg1Revision)) \
    ROM_API_SETUP_ROM_TABLE[16])

#define ROM_SetupSetAonRtcSubSecInc \
    ((void (*)(uint32_t subSecInc)) \
    ROM_API_SETUP_ROM_TABLE[17])

#define ROM_SetupSetCacheModeAccordingToCcfgSetting \
    ((void (*)(void)) \
    ROM_API_SETUP_ROM_TABLE[18])

#define ROM_SetupStepVddrTrimTo \
    ((void (*)(uint32_t toCode)) \
    ROM_API_SETUP_ROM_TABLE[19])

/* I2S FUNCTIONS */

#define ROM_I2SPointerSet \
    ((void (*)(uint32_t ui32Base, bool bInput, void * pNextPointer)) \
    ROM_API_I2S_TABLE[0])

#define ROM_I2SSampleStampGet \
    ((uint32_t (*)(uint32_t ui32Base, uint32_t ui32Channel)) \
    ROM_API_I2S_TABLE[1])

/* PWR_CTRL FUNCTIONS */

#define ROM_PowerCtrlSourceSet \
    ((void (*)(uint32_t ui32PowerConfig)) \
    ROM_API_PWR_CTRL_TABLE[0])

/* AES FUNCTIONS */

#define ROM_AESConfigureCCMCtrl \
    ((void (*)(uint32_t nonceLength, uint32_t macLength, bool encrypt)) \
    ROM_API_AES_TABLE[0])

#define ROM_AESReadFromKeyStore \
    ((uint32_t (*)(uint32_t keyStoreArea)) \
    ROM_API_AES_TABLE[1])

#define ROM_AESReadTag \
    ((uint32_t (*)(uint8_t *tag, uint32_t tagLength)) \
    ROM_API_AES_TABLE[2])

#define ROM_AESSetInitializationVector \
    ((void (*)(const uint32_t *initializationVector)) \
    ROM_API_AES_TABLE[3])

#define ROM_AESStartDMAOperation \
    ((void (*)(const uint8_t *channel0Addr, uint32_t channel0Length, uint8_t *channel1Addr, uint32_t channel1Length)) \
    ROM_API_AES_TABLE[4])

#define ROM_AESVerifyTag \
    ((uint32_t (*)(const uint8_t *tag, uint32_t tagLength)) \
    ROM_API_AES_TABLE[5])

#define ROM_AESWaitForIRQFlags \
    ((uint32_t (*)(uint32_t irqFlags)) \
    ROM_API_AES_TABLE[6])

#define ROM_AESWriteCCMInitializationVector \
    ((void (*)(const uint8_t *nonce, uint32_t nonceLength)) \
    ROM_API_AES_TABLE[7])

#define ROM_AESWriteToKeyStore \
    ((uint32_t (*)(const uint8_t *aesKey, uint32_t aesKeyLength, uint32_t keyStoreArea)) \
    ROM_API_AES_TABLE[8])

