apache/nuttx/arch/arm/src/tiva/cc13xx/cc13x2_cc26x2_v2_rom.h
/* PKA FUNCTIONS */

#define ROM_PKABigNumAddGetResult \
    ((uint32_t (*)(uint8_t *resultBuf, uint32_t *resultLength, uint32_t resultPKAMemAddr)) \
    ROM_API_PKA_TABLE[0])

#define ROM_PKABigNumCmpGetResult \
    ((uint32_t (*)(void)) \
    ROM_API_PKA_TABLE[1])

#define ROM_PKABigNumInvModGetResult \
    ((uint32_t (*)(uint8_t *resultBuf, uint32_t length, uint32_t resultPKAMemAddr)) \
    ROM_API_PKA_TABLE[2])

#define ROM_PKABigNumModGetResult \
    ((uint32_t (*)(uint8_t *resultBuf, uint32_t length, uint32_t resultPKAMemAddr)) \
    ROM_API_PKA_TABLE[3])

#define ROM_PKABigNumMultGetResult \
    ((uint32_t (*)(uint8_t *resultBuf, uint32_t *resultLength, uint32_t resultPKAMemAddr)) \
    ROM_API_PKA_TABLE[4])

#define ROM_PKAEccAddGetResult \
    ((uint32_t (*)(uint8_t *curvePointX, uint8_t *curvePointY, uint32_t resultPKAMemAddr, uint32_t length)) \
    ROM_API_PKA_TABLE[5])

#define ROM_PKAEccAddStart \
    ((uint32_t (*)(const uint8_t *curvePoint1X, const uint8_t *curvePoint1Y, const uint8_t *curvePoint2X, const uint8_t *curvePoint2Y, const uint8_t *prime, const uint8_t *a, uint32_t length, uint32_t *resultPKAMemAddr)) \
    ROM_API_PKA_TABLE[6])

#define ROM_PKAEccMultiplyGetResult \
    ((uint32_t (*)(uint8_t *curvePointX, uint8_t *curvePointY, uint32_t resultPKAMemAddr, uint32_t length)) \
    ROM_API_PKA_TABLE[7])

#define ROM_PKAEccMultiplyStart \
    ((uint32_t (*)(const uint8_t *scalar, const uint8_t *curvePointX, const uint8_t *curvePointY, const uint8_t *prime, const uint8_t *a, const uint8_t *b, uint32_t length, uint32_t *resultPKAMemAddr)) \
    ROM_API_PKA_TABLE[8])

#define ROM_PKAGetOpsStatus \
    ((uint32_t (*)(void)) \
    ROM_API_PKA_TABLE[9])

#define ROM_PKABigNumAddStart \
    ((uint32_t (*)(const uint8_t *bigNum1, uint32_t bigNum1Length, const uint8_t *bigNum2, uint32_t bigNum2Length, uint32_t *resultPKAMemAddr)) \
    ROM_API_PKA_TABLE[10])

#define ROM_PKABigNumCmpStart \
    ((uint32_t (*)(const uint8_t *bigNum1, const uint8_t *bigNum2, uint32_t length)) \
    ROM_API_PKA_TABLE[11])

#define ROM_PKABigNumInvModStart \
    ((uint32_t (*)(const uint8_t *bigNum, uint32_t bigNumLength, const uint8_t *modulus, uint32_t modulusLength, uint32_t *resultPKAMemAddr)) \
    ROM_API_PKA_TABLE[12])

#define ROM_PKABigNumModStart \
    ((uint32_t (*)(const uint8_t *bigNum, uint32_t bigNumLength, const uint8_t *modulus, uint32_t modulusLength, uint32_t *resultPKAMemAddr)) \
    ROM_API_PKA_TABLE[13])

#define ROM_PKABigNumMultiplyStart \
    ((uint32_t (*)(const uint8_t *multiplicand, uint32_t multiplicandLength, const uint8_t *multiplier, uint32_t multiplierLength, uint32_t *resultPKAMemAddr)) \
    ROM_API_PKA_TABLE[14])

#define ROM_PKABigNumSubGetResult \
    ((uint32_t (*)(uint8_t *resultBuf, uint32_t *resultLength, uint32_t resultPKAMemAddr)) \
    ROM_API_PKA_TABLE[15])

#define ROM_PKABigNumSubStart \
    ((uint32_t (*)(const uint8_t *minuend, uint32_t minuendLength, const uint8_t *subtrahend, uint32_t subtrahendLength, uint32_t *resultPKAMemAddr)) \
    ROM_API_PKA_TABLE[16])

#define ROM_PKAArrayAllZeros \
    ((bool (*)(const uint8_t *array, uint32_t arrayLength)) \
    ROM_API_PKA_TABLE[17])

#define ROM_PKABigNumDivideGetQuotient \
    ((uint32_t (*)(uint8_t *resultBuf, uint32_t *length, uint32_t resultQuotientMemAddr)) \
    ROM_API_PKA_TABLE[18])

#define ROM_PKABigNumDivideGetRemainder \
    ((uint32_t (*)(uint8_t *resultBuf, uint32_t *length, uint32_t resultRemainderMemAddr)) \
    ROM_API_PKA_TABLE[19])

#define ROM_PKABigNumDivideStart \
    ((uint32_t (*)(const uint8_t *dividend, uint32_t dividendLength, const uint8_t *divisor, uint32_t divisorLength, uint32_t *resultQuotientMemAddr, uint32_t *resultRemainderMemAddr)) \
    ROM_API_PKA_TABLE[20])

#define ROM_PKAEccVerifyPublicKeyWeierstrassStart \
    ((uint32_t (*)(const uint8_t *curvePointX, const uint8_t *curvePointY, const uint8_t *prime, const uint8_t *a, const uint8_t *b, const uint8_t *order, uint32_t length)) \
    ROM_API_PKA_TABLE[21])

#define ROM_PKAZeroOutArray \
    ((void (*)(const uint8_t *array, uint32_t arrayLength)) \
    ROM_API_PKA_TABLE[22])

#define ROM_PKAEccMontgomeryMultiplyStart \
    ((uint32_t (*)(const uint8_t *scalar, const uint8_t *curvePointX, const uint8_t *prime, const uint8_t *a, uint32_t length, uint32_t *resultPKAMemAddr)) \
    ROM_API_PKA_TABLE[23])

/* SHA2 FUNCTIONS */

#define ROM_SHA2ComputeFinalHash \
    ((uint32_t (*)(const uint8_t *message, uint8_t *resultDigest, uint32_t *intermediateDigest, uint32_t totalMsgLength, uint32_t messageLength, uint32_t hashAlgorithm)) \
    ROM_API_SHA2_TABLE[0])

#define ROM_SHA2ComputeHash \
    ((uint32_t (*)(const uint8_t *message, uint8_t *resultDigest, uint32_t totalMsgLength, uint32_t hashAlgorithm)) \
    ROM_API_SHA2_TABLE[1])

#define ROM_SHA2ComputeInitialHash \
    ((uint32_t (*)(const uint8_t *message, uint32_t *intermediateDigest, uint32_t hashAlgorithm, uint32_t initialMessageLength)) \
    ROM_API_SHA2_TABLE[2])

#define ROM_SHA2ComputeIntermediateHash \
    ((uint32_t (*)(const uint8_t *message, uint32_t *intermediateDigest, uint32_t hashAlgorithm, uint32_t intermediateMessageLength)) \
    ROM_API_SHA2_TABLE[3])

#define ROM_SHA2StartDMAOperation \
    ((void (*)(uint8_t *channel0Addr, uint32_t channel0Length, uint8_t *channel1Addr, uint32_t channel1Length)) \
    ROM_API_SHA2_TABLE[4])

#define ROM_SHA2WaitForIRQFlags \
    ((uint32_t (*)(uint32_t irqFlags)) \
    ROM_API_SHA2_TABLE[5])

/************************************************************************************
 * Public Types
 ************************************************************************************/

/* ROM Hard-API function interface types */

typedef uint32_t (*fptr_crc32_t)              (uint8_t *     /* data        */,\
                                               uint32_t      /* bytecount   */,\
                                               uint32_t      /* repeatcount */);

typedef uint32_t (*fptr_getflsize_t)          (void);

